<template>
  <h1 class="text-xl font-bold text-white my-4">利用規約</h1>
  <el-card class="m-4" shadow="never">
    <template #header>
      <div class="card-header">
        <span class="text-xl">利用規約</span>
      </div>
    </template>
    <p class="text item">
      謎解きデータベースの管理人(以下「管理人」といいます。)は，謎解きデータベース上で提供するサービス(以下「本サービス」といいます。)の利用について，以下の通りに利用規約(以下「本規約」といいます。)を定めます。
      利用者は予め本規約に同意した上で，本サービスを利用するものとします。
    </p>
  </el-card>
  <el-card class="m-4">
    <template #header>
      <div class="card-header" shadow="never">
        <span class="text-xl">個人情報の取り扱い</span>
      </div>
    </template>
    <p class="text item">本サービスにおいて，利用者の個人情報は<a href="/privacypolicy/" class="text-blue-400 hover:text-blue-500">プライバシーポリシー</a>に従って取り扱われます。</p>
  </el-card>
  <el-card class="m-4">
    <template #header>
      <div class="card-header" shadow="never">
        <span class="text-xl">利用環境</span>
      </div>
    </template>
    <p class="text item">
      利用者が本サービスを利用するためには，インターネットに接続する必要があります。
      利用者は，自らの責任と費用で必要な機器やソフトウェアなどを適切に準備・操作するものとし，管理人はそれらに関与しません。
    </p>
  </el-card>
  <el-card class="m-4">
    <template #header>
      <div class="card-header" shadow="never">
        <span class="text-xl">本サービスの停止</span>
      </div>
    </template>
    <p class="text item">
      管理人は，以下のいずれかの事由が生じた場合，本サービスを停止できるものとします。
    </p>
    <ul>
      <li>（１）本サービスを提供・運営するための設備などの点検を行う必要がある場合</li>
      <li>（２）本サービスの内容の変更やデータの調整などを行う際，利用者からのアクセスを遮断する必要がある場合</li>
      <li>（３）災害や事故などにより本サービスの提供・運営が困難となった場合</li>
      <li>（４）その他，本サービスの中断が必要と管理人が判断した場合</li>
    </ul>
    <p>
      本サービスの停止にあたり，事前に通知するように努力しますが，これを保証するものではありません。
      なお，本サービスを停止したことにより，利用者または第三者が損害を受けたとしても，管理人は一切の補償をしません。
    </p>
  </el-card>
  <el-card class="m-4">
    <template #header>
      <div class="card-header" shadow="never">
        <span class="text-xl">本サービスの変更・終了</span>
      </div>
    </template>
    <p class="text item">
      管理人が必要と判断した場合には，いつでも本サービスの内容を変更または終了できるものとします。
      本サービスの内容の変更・終了にあたり，事前に通知するように努力しますが，これを保証するものではありません。
      なお，本サービスの内容の一部または全部を変更・終了したことにより，利用者または第三者が損害を受けたとしても，管理人は一切の補償をしません。
    </p>
  </el-card>
  <el-card class="m-4">
    <template #header>
      <div class="card-header" shadow="never">
        <span class="text-xl">プライバシーポリシーの変更</span>
      </div>
    </template>
    <p class="text item">
      利用者は，自身の責任において本サービスを利用するものとします。
      また，利用者には以下のそれぞれについて予めご了承いただくものとします。
    </p>
    <ul>
      <li>（１）管理人は，本サービスの利用により発生した利用者の損害については，一切の賠償責任を負いません。</li>
      <li>（２）管理人は，本サービスの不具合や障害により発生した利用者の損害については，一切の賠償責任を負いません。</li>
      <li>（３）本サービスを利用することにより，利用者が第三者に対し損害を与えた場合，利用者は自己の費用と責任においてこれを賠償するものとします。</li>
      <li>（４）管理人は，掲載されたコンテンツやその他の情報・レビューコメントについて，正確性を含めていかなる保証もしません。
        また，それらによって利用者に生じた損害や，利用者同士のトラブル等について，管理人は一切の補償及び関与をしません。</li>
      <li>
        （５）管理人は，掲載されたコンテンツやその他の情報・レビューコメントについて，管理人が以下に該当・類似すると判断した場合，予告無くその一部または全部を本サービス上から削除する場合があります。
        <ul>
          <li>[1]本サービスの趣旨から逸脱するもの</li>
          <li>[2]公序良俗に反するもの</li>
          <li>[3]本サービスの管理・運営を妨げるもの</li>
          <li>[4]その他，管理人が不適切と判断したもの</li>
        </ul>
      </li>
      <li>（６）管理人は，掲載されたコンテンツやその他の情報について，管理人が重複して登録されていると判断した場合，予告無くその一部を本サービス上から削除する場合があります。
        の際，できるだけ欠落する情報の無いように，残る登録に情報を統合するように努めますが，これを保証するものではありません。</li>
      <li>（７）管理人は，本サービスからリンクされた第三者が運営するサイトに関して，正確性を含めていかなる保証もしません。
        また，それらによって利用者に生じた損害や，利用者同士のトラブル等について，管理人は一切の補償及び関与をしません。</li>
      <li>（８）システムの故障などにより，本サービスのデータが破損した場合であっても，管理人はその責任を負いません。</li>
    </ul>
  </el-card>
  <el-card class="m-4">
    <template #header>
      <div class="card-header" shadow="never">
        <span class="text-xl">財産権</span>
      </div>
    </template>
    <p class="text item">
      本サービスに掲載されている個々のコンテンツやその他の情報・商標・画像などに関する知的財産権およびその他の財産権は全て正当な権利者に帰属しています｡
      本サービスおよび本サービスに関連して使用されている全てのソフトウェアは，知的財産権に関する法令などにより保護されている権利を含んでいます。
    </p>
  </el-card>
  <el-card class="m-4">
    <template #header>
      <div class="card-header" shadow="never">
        <span class="text-xl">禁止行為</span>
      </div>
    </template>
    <p class="text item">
      利用者が本サービスを利用するに際して，次の行為を行うことを禁止します。
      <ul>
        <li>（１）本規約に違反すること</li>
        <li>（２）公序良俗に反すること</li>
        <li>（３）違法行為・犯罪的行為・重大な危険行為に結びつくこと，またはそれらを助長すること</li>
        <li>（４）本サービスの運営を妨げること，または管理人や本サービスの信用を毀損すること</li>
        <li>（５）ユーザー登録時に虚偽の申告をすること</li>
        <li>（６）同一人物が複数のユーザー登録を行うこと</li>
        <li>（７）ユーザーIDおよびパスワードを不正に使用すること，または他の利用者や第三者に使用させること</li>
        <li>（８）掲載されたコンテンツやその他の情報を故意に改ざん・毀損すること</li>
        <li>（９）その他，管理人が不適切と判断すること</li>
      </ul>
      これらに該当する行為が利用者によってなされたと管理人が判断した場合，管理人は当該利用者に対して，本サービスの利用の停止やその他の管理人が適切と判断する措置(以下「利用停止措置」といいます。)をとることができるものとします｡
      なお、利用停止措置は利用者の帰責性の有無にかかわらず管理人の裁量・判断に基づき行うことができるものとし，利用停止措置を行った理由については利用者に対してその一切をお答えしかねます｡
      加えて，利用停止措置に起因して利用者に生じた損害については，管理人は一切の責任を負わないものとします｡
    </p>
  </el-card>
  <el-card class="m-4">
    <template #header>
      <div class="card-header" shadow="never">
        <span class="text-xl">利用規約の変更</span>
      </div>
    </template>
    <p class="text item">
      管理人は，必要に応じて本規約の内容を変更できるものとします。
      本規約の変更については，本サービス内で告知する方法で利用者に通知します。
      変更後の本規約は，本ウェブサイトに掲載したときから効力を生じるものとします。
    </p>
  </el-card>
</template>
<script setup>
  useSeoMeta({
    title: '利用規約 | 謎解きデータベース',
    ogTitle: '利用規約 | 謎解きデータベース',
  });
</script>